Autodesk.Revit.DB.ViewAnchor
Since:
2026
An enumerated type listing options for the anchor point used by the placed view. The anchor point determines how the view position is updated if assigned to a saved position or swapped to another view.
Since:
2026

Autodesk.Revit.DB.ViewAnchor.BottomLeft
Available for crop-region enabled views and aligns the view using the bottom left of the crop region boundary as the reference.

Autodesk.Revit.DB.ViewAnchor.BottomRight
Available for crop-region enabled views and aligns the view using the bottom right of the crop region boundary as the reference.

Autodesk.Revit.DB.ViewAnchor.TopRight
Available for crop-region enabled views and aligns the view using the top right of the crop region boundary as the reference.

Autodesk.Revit.DB.ViewAnchor.TopLeft
Available for crop-region enabled views and aligns the view using the top left of the crop region boundary as the reference.

Autodesk.Revit.DB.ViewAnchor.Center
Available for crop-region enabled views and aligns the view using the center of the crop region boundary as the reference.

Autodesk.Revit.DB.ViewAnchor.ViewOrigin
Available for all views and aligns the view using the origin of the view as the reference.